Description: Recipe description
Identifier: com.github.moofit-recipes.download.LoopEmail
Input:
  NAME: Loop Email
  URL: https://www.intheloop.io/install/mac/

MinimumVersion: '2.3'
Process:

  - Processor: URLTextSearcher
    Arguments:
      url: "%URL%"
      re_pattern: "https://dl.intheloop.io/Loop-Email.dmg"

  - Processor: URLDownloader
    Arguments:
      url: "https://dl.intheloop.io/Loop-Email.dmg"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/%NAME%.app"
      requirement: identifier "com.intheloop.intheloop" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GHQRCL58Q8

  - Processor: EndOfCheckPhase

  - Processor: PlistReader
    Arguments:
      info_path: "%pathname%/%NAME%.app/Contents/Info.plist"
      plist_keys:
        CFBundleShortVersionString: version
        CFBundleIdentifier: bundleid